export default {
  projections: {
    КомнатаE: {
      кодКомнаты: {
        __caption__: 'Код комнаты'
      },
      стоимость: {
        __caption__: 'Стоимость'
      },
      класс: {
        __caption__: 'Класс'
      },
      колвоМест: {
        __caption__: 'Колво мест'
      },
      отель: {
        __caption__: 'Отель',
        адрес: {
          __caption__: 'Адрес'
        }
      }
    },
    КомнатаL: {
      кодКомнаты: {
        __caption__: 'Код комнаты'
      },
      стоимость: {
        __caption__: 'Стоимость'
      },
      класс: {
        __caption__: 'Класс'
      },
      колвоМест: {
        __caption__: 'Колво мест'
      },
      отель: {
        __caption__: 'Адрес',
        адрес: {
          __caption__: 'Адрес'
        }
      }
    }
  },
  validations: {
    класс: {
      __caption__: 'Класс'
    },
    кодКомнаты: {
      __caption__: 'Код комнаты'
    },
    колвоМест: {
      __caption__: 'Колво мест'
    },
    стоимость: {
      __caption__: 'Стоимость'
    },
    отель: {
      __caption__: 'Отель'
    }
  }
};
