export default {
  projections: {
    ДоступE: {
      доступ: {
        __caption__: 'Доступ'
      },
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      комната: {
        __caption__: 'Комната',
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        класс: {
          __caption__: 'Класс'
        },
        колвоМест: {
          __caption__: 'Колво мест'
        },
        стоимость: {
          __caption__: 'Стоимость'
        }
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        имя: {
          __caption__: 'Имя'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      гости: {
        __caption__: 'Гости',
        имя: {
          __caption__: 'Имя'
        },
        кодГостя: {
          __caption__: 'Код гостя'
        },
        отчество: {
          __caption__: 'Отчество'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        комментарий: {
          __caption__: 'Комментарий'
        }
      },
      регистрЗаписи: {
        __caption__: 'Регистр записи',
        кодРегитсра: {
          __caption__: 'Код регитсра'
        },
        датаЗаселения: {
          __caption__: 'Дата заселения'
        },
        датаВыезда: {
          __caption__: 'Дата выезда'
        }
      }
    },
    ДоступL: {
      доступ: {
        __caption__: 'Доступ'
      },
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      комната: {
        __caption__: 'Код комнаты',
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        класс: {
          __caption__: 'Класс'
        },
        колвоМест: {
          __caption__: 'Колво мест'
        },
        стоимость: {
          __caption__: 'Стоимость'
        }
      },
      сотрудники: {
        __caption__: 'Имя',
        имя: {
          __caption__: 'Имя'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      }
    }
  },
  validations: {
    доступ: {
      __caption__: 'Доступ'
    },
    кодДоступа: {
      __caption__: 'Код доступа'
    },
    комната: {
      __caption__: 'Комната'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    },
    гости: {
      __caption__: 'Гости'
    },
    регистрЗаписи: {
      __caption__: 'Регистр записи'
    }
  }
};
